Revit 2024 API
DefinitionGroups.GetEnumerator Method
Retrieves an enumerator to the collection.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual IEnumerator<DefinitionGroup> GetEnumerator()
Visual Basic
Public Overridable Function GetEnumerator As IEnumerator(Of DefinitionGroup)
Visual C++
public:
virtual IEnumerator<DefinitionGroup^>^ GetEnumerator()
Return Value
The enumerator.
Implements
IEnumerable<T>.GetEnumerator()
See Also
DefinitionGroups Class
Autodesk.Revit.DB Namespace